class Solution:
    # 枚举所有数，该数后面头尾指针找区间
    def threeSum(self, nums):
        i, j = 0, 0
        res = []
        for index,item in enumerate(nums):
            arr = nums[index+1:]
            arr = sorted(arr) # 从小到大排序
            i = 0
            j = len(arr) - 1
            
            # a+b+c=0
            # c=-(a+b)
            while i != j and arr:
                if item == -(arr[i]+arr[j]):
                    arr_push = sorted([item, arr[i], arr[j]])
                    if arr_push not in res:
                        res.append(arr_push)
                    j -= 1
                    # i += 1
                elif item + arr[i]+arr[j] > 0:
                    j -= 1
                elif item + arr[i]+arr[j] < 0:
                    i += 1
        return res

# class Solution:
#     # 枚举所有数，该数后面头尾指针找区间
#     def threeSum(self, nums):
#         i, j = 0, 0
#         res = set()
#         nums = sorted(nums)
#         for index,item in enumerate(nums):
#             arr = nums[index+1:]
#             arr = sorted(arr) # 从小到大排序
#             i = 0
#             j = len(arr) - 1
            
#             # a+b+c=0
#             # c=-(a+b)
#             while i != j and arr:
#                 if item == -(arr[i]+arr[j]):
#                     # arr_push = sorted()
#                     # if arr_push not in res:
#                     res.add((item, arr[i], arr[j]))
#                     j -= 1
#                     # i += 1
#                 elif item + arr[i]+arr[j] > 0:
#                     j -= 1
#                 elif item + arr[i]+arr[j] < 0:
#                     i += 1
#         return list(map(list, res))


if __name__ == '__main__':
    a = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
    b = Solution()
    print(b.threeSum(a))
    # print([-1, 0, 1] == [0, -1, 1])